wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_spi.h
/* SPI_RCRC */
#define SPI_RCRC_RCRC                   BITS(0,31)                              /*!< Rx CRC register */

/* SPI_URDATA */
#define SPI_URDATA_URDATA               BITS(0,31)                              /*!< transmission underrun data at slave mode */

/* SPI_I2SCTL */
#define SPI_I2SCTL_CHLEN                BIT(0)                                  /*!< channel length */
#define SPI_I2SCTL_DTLEN                BITS(1,2)                               /*!< data length */
#define SPI_I2SCTL_CKPL                 BIT(3)                                  /*!< idle state clock polarity */
#define SPI_I2SCTL_I2SSTD               BITS(4,5)                               /*!< I2S standard selection */
#define SPI_I2SCTL_PCMSMOD              BIT(7)                                  /*!< PCM frame synchronization mode */
#define SPI_I2SCTL_I2SOPMOD             BITS(8,9)                               /*!< I2S operation mode */
#define SPI_I2SCTL_I2SEN                BIT(10)                                 /*!< I2S enable */
#define SPI_I2SCTL_I2SSEL               BIT(11)                                 /*!< I2S mode selection */
#define SPI_I2SCTL_DIV                  BITS(16,23)                             /*!< dividing factor for the prescaler */
#define SPI_I2SCTL_OF                   BIT(24)                                 /*!< odd factor for the prescaler */
#define SPI_I2SCTL_MCKOEN               BIT(25)                                 /*!< I2S_MCK output enable */
#define SPI_I2SCTL_I2SCH                BIT(31)                                 /*!< I2S Channel side */

/* SPI_QCTL(only for SPI3/4) */
#define SPI_QCTL_QMOD                   BIT(0)                                  /*!< quad-SPI mode enable */
#define SPI_QCTL_QRD                    BIT(1)                                  /*!< quad-SPI mode read select */

/* SPI_RXDLYCK */
#define SPI_RXDLYCK_SRXD                BITS(0,4)                               /*!< slave mode receive clock delay units*/
#define SPI_RXDLYCK_SRXDEN              BIT(5)                                  /*!< slave mode receive clock delay enable*/
#define SPI_RXDLYCK_MRXD                BITS(6,10)                              /*!< master mode receive clock delay units*/
#define SPI_RXDLYCK_MRXDEN              BIT(11)                                 /*!< master mode receive clock delay enable*/

/* constants definitions */
/* SPI and I2S parameter struct definitions */
typedef struct {
    uint32_t device_mode;                                                       /*!< SPI master or slave */
    uint32_t trans_mode;                                                        /*!< SPI transtype */
    uint32_t data_size;                                                         /*!< SPI data frame size */
    uint32_t nss;                                                               /*!< SPI NSS control by hardware or software */
    uint32_t endian;                                                            /*!< SPI big endian or little endian */
    uint32_t clock_polarity_phase;                                              /*!< SPI clock phase and polarity */
    uint32_t prescale;                                                          /*!< SPI prescale factor */
} spi_parameter_struct;

/* SPI suspend in receive mode */
#define SPI_AUTO_SUSPEND                SPI_CTL0_MASP                           /*!< until the overrun condition is reached, the SPI stream is suspended in the full RxFIFO state */
#define SPI_CONTINUOUS                  ((uint32_t)0x00000000U)                 /*!< SPI stream/clock generation is continuous whether or not an overrun occurs */

/* SPI master start transfer */
#define SPI_TRANS_START                 SPI_CTL0_MSTART                         /*!< the master transmission is occurring, or has been temporarily suspended by automatic suspend */
#define SPI_TRANS_IDLE                  ((uint32_t)0x00000000U)                 /*!< the master transfer is idle status */

/* SPI NSS input level */
#define SPI_NSS_LEVEL_HIGH              SPI_CTL0_NSSI                           /*!< NSS pin is pulled high */
#define SPI_NSS_LEVEL_LOW               ((uint32_t)0x00000000U)                 /*!< NSS pin is pulled low */

/* SPI TCRC init pattern */
#define SPI_TCRC_INIT_1                 SPI_CTL0_TXCRCI                         /*!< use all 1 pattern */
#define SPI_TCRC_INIT_0                 ((uint32_t)0x00000000U)                 /*!< use all 0 pattern */

/* SPI RCRC init pattern */
#define SPI_RCRC_INIT_1                 SPI_CTL0_RXCRCI                         /*!< use all 1 pattern */
#define SPI_RCRC_INIT_0                 ((uint32_t)0x00000000U)                 /*!< use all 0 pattern */

/* SPI data frame size */
#define CFG0_DZ(regval)                 (BITS(0,4) & ((uint32_t)(regval) << 0))
#define SPI_DATASIZE_4BIT               CFG0_DZ(3)                              /*!< SPI data frame size is 4-bit */
#define SPI_DATASIZE_5BIT               CFG0_DZ(4)                              /*!< SPI data frame size is 5-bit */
#define SPI_DATASIZE_6BIT               CFG0_DZ(5)                              /*!< SPI data frame size is 6-bit */
#define SPI_DATASIZE_7BIT               CFG0_DZ(6)                              /*!< SPI data frame size is 7-bit */
#define SPI_DATASIZE_8BIT               CFG0_DZ(7)                              /*!< SPI data frame size is 8-bit */
#define SPI_DATASIZE_9BIT               CFG0_DZ(8)                              /*!< SPI data frame size is 9-bit */
#define SPI_DATASIZE_10BIT              CFG0_DZ(9)                              /*!< SPI data frame size is 10-bit */
#define SPI_DATASIZE_11BIT              CFG0_DZ(10)                             /*!< SPI data frame size is 11-bit */
#define SPI_DATASIZE_12BIT              CFG0_DZ(11)                             /*!< SPI data frame size is 12-bit */
#define SPI_DATASIZE_13BIT              CFG0_DZ(12)                             /*!< SPI data frame size is 13-bit */
#define SPI_DATASIZE_14BIT              CFG0_DZ(13)                             /*!< SPI data frame size is 14-bit */
#define SPI_DATASIZE_15BIT              CFG0_DZ(14)                             /*!< SPI data frame size is 15-bit */
#define SPI_DATASIZE_16BIT              CFG0_DZ(15)                             /*!< SPI data frame size is 16-bit */
#define SPI_DATASIZE_17BIT              CFG0_DZ(16)                             /*!< SPI data frame size is 17-bit */
#define SPI_DATASIZE_18BIT              CFG0_DZ(17)                             /*!< SPI data frame size is 18-bit */
#define SPI_DATASIZE_19BIT              CFG0_DZ(18)                             /*!< SPI data frame size is 19-bit */
#define SPI_DATASIZE_20BIT              CFG0_DZ(19)                             /*!< SPI data frame size is 20-bit */
#define SPI_DATASIZE_21BIT              CFG0_DZ(20)                             /*!< SPI data frame size is 21-bit */
#define SPI_DATASIZE_22BIT              CFG0_DZ(21)                             /*!< SPI data frame size is 22-bit */
#define SPI_DATASIZE_23BIT              CFG0_DZ(22)                             /*!< SPI data frame size is 23-bit */
#define SPI_DATASIZE_24BIT              CFG0_DZ(23)                             /*!< SPI data frame size is 24-bit */
#define SPI_DATASIZE_25BIT              CFG0_DZ(24)                             /*!< SPI data frame size is 25-bit */
#define SPI_DATASIZE_26BIT              CFG0_DZ(25)                             /*!< SPI data frame size is 26-bit */
#define SPI_DATASIZE_27BIT              CFG0_DZ(26)                             /*!< SPI data frame size is 27-bit */
#define SPI_DATASIZE_28BIT              CFG0_DZ(27)                             /*!< SPI data frame size is 28-bit */
#define SPI_DATASIZE_29BIT              CFG0_DZ(28)                             /*!< SPI data frame size is 29-bit */
#define SPI_DATASIZE_30BIT              CFG0_DZ(29)                             /*!< SPI data frame size is 30-bit */
#define SPI_DATASIZE_31BIT              CFG0_DZ(30)                             /*!< SPI data frame size is 31-bit */
#define SPI_DATASIZE_32BIT              CFG0_DZ(31)                             /*!< SPI data frame size is 32-bit */

/* SPI FIFO threshold level */
#define CFG0_FIFOLVL(regval)            (BITS(5,8) & ((uint32_t)(regval) << 5))
#define SPI_FIFO_TH_01DATA              CFG0_FIFOLVL(0)                         /*!< set FIFO threshold level = 1-data frame */
#define SPI_FIFO_TH_02DATA              CFG0_FIFOLVL(1)                         /*!< set FIFO threshold level = 2-data frame */
#define SPI_FIFO_TH_03DATA              CFG0_FIFOLVL(2)                         /*!< set FIFO threshold level = 3-data frame */
#define SPI_FIFO_TH_04DATA              CFG0_FIFOLVL(3)                         /*!< set FIFO threshold level = 4-data frame */
#define SPI_FIFO_TH_05DATA              CFG0_FIFOLVL(4)                         /*!< set FIFO threshold level = 5-data frame */
#define SPI_FIFO_TH_06DATA              CFG0_FIFOLVL(5)                         /*!< set FIFO threshold level = 6-data frame */
#define SPI_FIFO_TH_07DATA              CFG0_FIFOLVL(6)                         /*!< set FIFO threshold level = 7-data frame */
#define SPI_FIFO_TH_08DATA              CFG0_FIFOLVL(7)                         /*!< set FIFO threshold level = 8-data frame */
#define SPI_FIFO_TH_09DATA              CFG0_FIFOLVL(8)                         /*!< set FIFO threshold level = 9-data frame */
#define SPI_FIFO_TH_10DATA              CFG0_FIFOLVL(9)                         /*!< set FIFO threshold level = 10-data frame */
#define SPI_FIFO_TH_11DATA              CFG0_FIFOLVL(10)                        /*!< set FIFO threshold level = 11-data frame */
#define SPI_FIFO_TH_12DATA              CFG0_FIFOLVL(11)                        /*!< set FIFO threshold level = 12-data frame */
#define SPI_FIFO_TH_13DATA              CFG0_FIFOLVL(12)                        /*!< set FIFO threshold level = 13-data frame */
#define SPI_FIFO_TH_14DATA              CFG0_FIFOLVL(13)                        /*!< set FIFO threshold level = 14-data frame */
#define SPI_FIFO_TH_15DATA              CFG0_FIFOLVL(14)                        /*!< set FIFO threshold level = 15-data frame */
#define SPI_FIFO_TH_16DATA              CFG0_FIFOLVL(15)                        /*!< set FIFO threshold level = 16-data frame */

/* SPI slave transmitter underrun detected operation */
#define CFG0_TXUROP(regval)             (BITS(9,10) & ((uint32_t)(regval) << 9))
#define SPI_CONFIG_REGISTER_PATTERN     CFG0_TXUROP(0)                          /*!< slave send a constant value defined by the SPI_URDATA register */
#define SPI_CONFIG_LAST_RECEIVED        CFG0_TXUROP(1)                          /*!< slave send the data frame received from master lastly */
#define SPI_CONFIG_LAST_TRANSMITTED     CFG0_TXUROP(2)                          /*!< Slave send the data frame which is lastly transmitted by itself */

/* SPI slave transmitter underrun detected config */
#define CFG0_TXURDT(regval)             (BITS(11,12) & ((uint32_t)(regval) << 11))
#define SPI_DETECT_BEGIN_DATA_FRAME     CFG0_TXURDT(0)                          /*!< underrun detected at start of data frame (no bit 1 protection) */
#define SPI_DETECT_END_DATA_FRAME       CFG0_TXURDT(1)                          /*!< underrun detected at end of last data frame */
#define SPI_DETECT_BEGIN_ACTIVE_NSS     CFG0_TXURDT(2)                          /*!< underrun detected at start of NSS signal */

/* SPI CRC size */
#define CFG0_CRCSZ(regval)              (BITS(16,20) & ((uint32_t)(regval) << 16))
#define SPI_CRCSIZE_4BIT                CFG0_CRCSZ(3)                           /*!< SPI crc size is 4-bit */
#define SPI_CRCSIZE_5BIT                CFG0_CRCSZ(4)                           /*!< SPI crc size is 5-bit */
#define SPI_CRCSIZE_6BIT                CFG0_CRCSZ(5)                           /*!< SPI crc size is 6-bit */
#define SPI_CRCSIZE_7BIT                CFG0_CRCSZ(6)                           /*!< SPI crc size is 7-bit */
#define SPI_CRCSIZE_8BIT                CFG0_CRCSZ(7)                           /*!< SPI crc size is 8-bit */
#define SPI_CRCSIZE_9BIT                CFG0_CRCSZ(8)                           /*!< SPI crc size is 9-bit */
#define SPI_CRCSIZE_10BIT               CFG0_CRCSZ(9)                           /*!< SPI crc size is 10-bit */
#define SPI_CRCSIZE_11BIT               CFG0_CRCSZ(10)                          /*!< SPI crc size is 11-bit */
#define SPI_CRCSIZE_12BIT               CFG0_CRCSZ(11)                          /*!< SPI crc size is 12-bit */
#define SPI_CRCSIZE_13BIT               CFG0_CRCSZ(12)                          /*!< SPI crc size is 13-bit */
#define SPI_CRCSIZE_14BIT               CFG0_CRCSZ(13)                          /*!< SPI crc size is 14-bit */
#define SPI_CRCSIZE_15BIT               CFG0_CRCSZ(14)                          /*!< SPI crc size is 15-bit */
#define SPI_CRCSIZE_16BIT               CFG0_CRCSZ(15)                          /*!< SPI crc size is 16-bit */
#define SPI_CRCSIZE_17BIT               CFG0_CRCSZ(16)                          /*!< SPI crc size is 17-bit */
#define SPI_CRCSIZE_18BIT               CFG0_CRCSZ(17)                          /*!< SPI crc size is 18-bit */
#define SPI_CRCSIZE_19BIT               CFG0_CRCSZ(18)                          /*!< SPI crc size is 19-bit */
#define SPI_CRCSIZE_20BIT               CFG0_CRCSZ(19)                          /*!< SPI crc size is 20-bit */
#define SPI_CRCSIZE_21BIT               CFG0_CRCSZ(20)                          /*!< SPI crc size is 21-bit */
#define SPI_CRCSIZE_22BIT               CFG0_CRCSZ(21)                          /*!< SPI crc size is 22-bit */
#define SPI_CRCSIZE_23BIT               CFG0_CRCSZ(22)                          /*!< SPI crc size is 23-bit */
#define SPI_CRCSIZE_24BIT               CFG0_CRCSZ(23)                          /*!< SPI crc size is 24-bit */
#define SPI_CRCSIZE_25BIT               CFG0_CRCSZ(24)                          /*!< SPI crc size is 25-bit */
#define SPI_CRCSIZE_26BIT               CFG0_CRCSZ(25)                          /*!< SPI crc size is 26-bit */
#define SPI_CRCSIZE_27BIT               CFG0_CRCSZ(26)                          /*!< SPI crc size is 27-bit */
#define SPI_CRCSIZE_28BIT               CFG0_CRCSZ(27)                          /*!< SPI crc size is 28-bit */
#define SPI_CRCSIZE_29BIT               CFG0_CRCSZ(28)                          /*!< SPI crc size is 29-bit */
#define SPI_CRCSIZE_30BIT               CFG0_CRCSZ(29)                          /*!< SPI crc size is 30-bit */
#define SPI_CRCSIZE_31BIT               CFG0_CRCSZ(30)                          /*!< SPI crc size is 31-bit */
#define SPI_CRCSIZE_32BIT               CFG0_CRCSZ(31)                          /*!< SPI crc size is 32-bit */

/* SPI clock prescale factor */
#define CFG0_PSC(regval)                (BITS(28,30) & ((uint32_t)(regval) << 28))
#define SPI_PSC_2                       CFG0_PSC(0)                             /*!< SPI clock prescale factor is 2 */
#define SPI_PSC_4                       CFG0_PSC(1)                             /*!< SPI clock prescale factor is 4 */
#define SPI_PSC_8                       CFG0_PSC(2)                             /*!< SPI clock prescale factor is 8 */
#define SPI_PSC_16                      CFG0_PSC(3)                             /*!< SPI clock prescale factor is 16 */
#define SPI_PSC_32                      CFG0_PSC(4)                             /*!< SPI clock prescale factor is 32 */
#define SPI_PSC_64                      CFG0_PSC(5)                             /*!< SPI clock prescale factor is 64 */
#define SPI_PSC_128                     CFG0_PSC(6)                             /*!< SPI clock prescale factor is 128 */
#define SPI_PSC_256                     CFG0_PSC(7)                             /*!< SPI clock prescale factor is 256 */

/* SPI NSS idleness delay */
#define CFG1_MSSD(regval)               (BITS(0,3) & ((uint32_t)(regval) << 0))
#define SPI_NSS_IDLENESS_00CYCLE        CFG1_MSSD(0)                            /*!< no delay between active edge of NSS and transmittion */
#define SPI_NSS_IDLENESS_01CYCLE        CFG1_MSSD(1)                            /*!< 1 clock cycle delay between active edge of NSS and transmission */
#define SPI_NSS_IDLENESS_02CYCLE        CFG1_MSSD(2)                            /*!< 2 clock cycle delay between active edge of NSS and transmission */
#define SPI_NSS_IDLENESS_03CYCLE        CFG1_MSSD(3)                            /*!< 3 clock cycle delay between active edge of NSS and transmission */
#define SPI_NSS_IDLENESS_04CYCLE        CFG1_MSSD(4)                            /*!< 4 clock cycle delay between active edge of NSS and transmission */
#define SPI_NSS_IDLENESS_05CYCLE        CFG1_MSSD(5)                            /*!< 5 clock cycle delay between active edge of NSS and transmission */
#define SPI_NSS_IDLENESS_06CYCLE        CFG1_MSSD(6)                            /*!< 6 clock cycle delay between active edge of NSS and transmission */
#define SPI_NSS_IDLENESS_07CYCLE        CFG1_MSSD(7)                            /*!< 7 clock cycle delay between active edge of NSS and transmission */
#define SPI_NSS_IDLENESS_08CYCLE        CFG1_MSSD(8)                            /*!< 8 clock cycle delay between active edge of NSS and transmission */
#define SPI_NSS_IDLENESS_09CYCLE        CFG1_MSSD(9)                            /*!< 9 clock cycle delay between active edge of NSS and transmission */
#define SPI_NSS_IDLENESS_10CYCLE        CFG1_MSSD(10)                           /*!< 10 clock cycle delay between active edge of NSS and transmission */
#define SPI_NSS_IDLENESS_11CYCLE        CFG1_MSSD(11)                           /*!< 11 clock cycle delay between active edge of NSS and transmission */
#define SPI_NSS_IDLENESS_12CYCLE        CFG1_MSSD(12)                           /*!< 12 clock cycle delay between active edge of NSS and transmission */
#define SPI_NSS_IDLENESS_13CYCLE        CFG1_MSSD(13)                           /*!< 13 clock cycle delay between active edge of NSS and transmission */
#define SPI_NSS_IDLENESS_14CYCLE        CFG1_MSSD(14)                           /*!< 14 clock cycle delay between active edge of NSS and transmission */
#define SPI_NSS_IDLENESS_15CYCLE        CFG1_MSSD(15)                           /*!< 15 clock cycle delay between active edge of NSS and transmission */

/* SPI master data frame delay */
#define CFG1_MDFD(regval)               (BITS(4,7) & ((uint32_t)(regval) << 4))
#define SPI_DATA_IDLENESS_00CYCLE       CFG1_MDFD(0)                            /*!< no delay between data frames in SPI master mode */
#define SPI_DATA_IDLENESS_01CYCLE       CFG1_MDFD(1)                            /*!< 1 clock cycle delay between data frames in SPI master mode */
#define SPI_DATA_IDLENESS_02CYCLE       CFG1_MDFD(2)                            /*!< 2 clock cycle delay between data frames in SPI master mode */
#define SPI_DATA_IDLENESS_03CYCLE       CFG1_MDFD(3)                            /*!< 3 clock cycle delay between data frames in SPI master mode */
#define SPI_DATA_IDLENESS_04CYCLE       CFG1_MDFD(4)                            /*!< 4 clock cycle delay between data frames in SPI master mode */
#define SPI_DATA_IDLENESS_05CYCLE       CFG1_MDFD(5)                            /*!< 5 clock cycle delay between data frames in SPI master mode */
#define SPI_DATA_IDLENESS_06CYCLE       CFG1_MDFD(6)                            /*!< 6 clock cycle delay between data frames in SPI master mode */
#define SPI_DATA_IDLENESS_07CYCLE       CFG1_MDFD(7)                            /*!< 7 clock cycle delay between data frames in SPI master mode */
#define SPI_DATA_IDLENESS_08CYCLE       CFG1_MDFD(8)                            /*!< 8 clock cycle delay between data frames in SPI master mode */
#define SPI_DATA_IDLENESS_09CYCLE       CFG1_MDFD(9)                            /*!< 9 clock cycle delay between data frames in SPI master mode */
#define SPI_DATA_IDLENESS_10CYCLE       CFG1_MDFD(10)                           /*!< 10 clock cycle delay between data frames in SPI master mode */
#define SPI_DATA_IDLENESS_11CYCLE       CFG1_MDFD(11)                           /*!< 11 clock cycle delay between data frames in SPI master mode */
#define SPI_DATA_IDLENESS_12CYCLE       CFG1_MDFD(12)                           /*!< 12 clock cycle delay between data frames in SPI master mode */
#define SPI_DATA_IDLENESS_13CYCLE       CFG1_MDFD(13)                           /*!< 13 clock cycle delay between data frames in SPI master mode */
#define SPI_DATA_IDLENESS_14CYCLE       CFG1_MDFD(14)                           /*!< 14 clock cycle delay between data frames in SPI master mode */
#define SPI_DATA_IDLENESS_15CYCLE       CFG1_MDFD(15)                           /*!< 15 clock cycle delay between data frames in SPI master mode */

/* SPI IO swap */
#define SPI_IO_SWAP                     SPI_CFG1_SWPMIO                         /*!< SPI MOSI and MISO swap */
#define SPI_IO_NORMAL                   (~SPI_CFG1_SWPMIO)                      /*!< SPI MOSI and MISO no swap */

/* SPI bidirectional transfer direction */
#define SPI_BIDIRECTIONAL_TRANSMIT      SPI_CFG1_BDOEN                          /*!< SPI work in transmit-only mode */
#define SPI_BIDIRECTIONAL_RECEIVE       (~SPI_CFG1_BDOEN)                       /*!< SPI work in receive-only mode */

/* SPI transmit type */
#define SPI_TRANSMODE_FULLDUPLEX        ((uint32_t)0x00000000U)                 /*!< SPI receive and send data at fullduplex communication */
#define SPI_TRANSMODE_RECEIVEONLY       SPI_CFG1_RO                             /*!< SPI only receive data */
#define SPI_TRANSMODE_BDRECEIVE         SPI_CFG1_BDEN                           /*!< bidirectional receive data */
#define SPI_TRANSMODE_BDTRANSMIT        (SPI_CFG1_BDEN | SPI_CFG1_BDOEN)        /*!< bidirectional transmit data*/

/* SPI mode definitions */
#define SPI_MASTER                      SPI_CFG1_MSTMOD                         /*!< SPI as master */
#define SPI_SLAVE                       ((uint32_t)0x00000000U)                 /*!< SPI as slave */

/* SPI transmit way */
#define SPI_ENDIAN_MSB                  ((uint32_t)0x00000000U)                 /*!< SPI transmit way is big endian: transmit MSB first */
#define SPI_ENDIAN_LSB                  SPI_CFG1_LF                             /*!< SPI transmit way is little endian: transmit LSB first */

/* SPI clock phase and polarity */
#define SPI_CK_PL_LOW_PH_1EDGE          ((uint32_t)0x00000000U)                 /*!< SPI clock polarity is low level and phase is first edge */
#define SPI_CK_PL_HIGH_PH_1EDGE         SPI_CFG1_CKPL                           /*!< SPI clock polarity is high level and phase is first edge */
#define SPI_CK_PL_LOW_PH_2EDGE          SPI_CFG1_CKPH                           /*!< SPI clock polarity is low level and phase is second edge */
#define SPI_CK_PL_HIGH_PH_2EDGE         (SPI_CFG1_CKPL | SPI_CFG1_CKPH)         /*!< SPI clock polarity is high level and phase is second edge */

/* SPI NSS control mode */
#define SPI_NSS_SOFT                    SPI_CFG1_NSSIM                          /*!< SPI NSS control by software */
#define SPI_NSS_HARD                    ((uint32_t)0x00000000U)                 /*!< SPI NSS control by hardware */

/* SPI NSS polarity */
#define SPI_NSS_POLARITY_HIGH           SPI_CFG1_NSSIOPL                        /*!< SPI NSS high level is active */
#define SPI_NSS_POLARITY_LOW            ((uint32_t)0x00000000U)                 /*!< SPI NSS low level is active */

